<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2013 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['ac_not_def'] = 'Это важный шаг, но в дальнейшем он не будет запрашиваться снова';
$lang['ac_text'] = 'Эта галерея включает содержимое для взрослых';
$lang['ad_c_manage_pornonly'] = 'только порнографическое содержимое';
$lang['ad_c_menublock_for_guest'] = 'Разрешить незарегистрированным пользователям указывать их возраст?';
$lang['ad_c_msg_admin_1'] = 'Настройки Плагина успешно сохранены!';
$lang['ad_c_send'] = 'Сохранить изменения';
$lang['Disclaimer for the guest, with the ability to choose its age to unlock the adult content'] = 'Отказ от ответственности для гостей с возможностью выбрать возраст';
$lang['ac_title_fermer'] = 'фильтр содержимого';
$lang['ac_title_menu'] = 'Предупреждение';
$lang['ac_title_menu_statut'] = 'Информация';
$lang['ac_user_no'] = 'Вы не хотите активировать содержимое этого типа';
$lang['ac_user_no_s'] = 'Фильтр содержимого';
$lang['ac_user_text_16'] = 'Вам 16 или 17 лет';
$lang['ac_user_text_18'] = 'Вам более 18 лет';
$lang['ad_c_manage_both'] = 'эротическое и порнографическое содержимое';
$lang['ad_c_manage_eroticonly'] = 'только эротическое содержимое';
$lang['ac_button_activ_16'] = 'Активировать эротическое содержание';
$lang['ac_button_activ_18'] = 'Активировать порнографическое содержание содержание';
$lang['ac_charte_user_def'] = 'иначе кликните здесь';
$lang['ac_charte_user_not'] = 'Пожалуйста укажите Ваш возраст';
$lang['ac_def'] = 'Хотите изменить Ваш статус?';
$lang['ac_fermer'] = 'или закрыть';
$lang['ac_identif'] = 'или войти';
$lang['ac_lien'] = 'убрать эту защиту';
$lang['ac_logout'] = 'иначе кликните здесь';
$lang['ac_retour'] = 'Я не хочу активировать этот тип содержимого и возвращаюсь на предыдущую страницу';
$lang['ac_retour_b'] = 'Я не хочу видеть содержимое этого типа';
$lang['ac_retour_c'] = 'Я возвращаюсь на предыдущую страницу';
$lang['ad_c_manage_what'] = 'Выберите тип содержимого управляемого плагином';
$lang['ac_text_activ_18'] = '  <u>... и я гарантирую, что </u>: <br>
- <B> Я старше 18 лет и я совершеннолетний, </B> согласно действующих законов в моей стране. <br>
- Я предупрежден, что данный сайт содержит изображения порнографического или эротического содержания. <br>
- Законы моей страны разрешают мне доступ к этому сайту.';
$lang['ac_text_activ_16'] = '<u> ... и я гарантирую, что </u>: <br>
        - <B> Мне 16 или 17 лет.</B> <br>
- Я предупрежден, что данный сайт содержит изображения порнографического или эротического содержания. <br>
- Законы моей страны разрешают мне доступ к этому сайту.';
$lang['ad_c_linktolang'] = 'Перейти в файл языка Adult_Content (необходим включенный плагин LocalFilesEditir)';
$lang['ac_statut'] = 'Ваш статус:';
$lang['ac_text_charte'] = 'Вы входите на сайт, содержащий изображения, которые носят эротический и порнографический характер, они предназначены исключительно для предупрежденных посетителей, допускающих просмотр содержимого эротического характера. Посещение этого сайта происходит по личному желанию людей. Настоящий сайт снимает с себя любую ответственность за последствия, которые могут быть нанесены содержанием и услугами этого сайта любому человеку, вплоть до того, что любой может быть шокирован. Каждый человек, согласившийся на вход на данный сайт, публично строго предупрежден и принимает на себя все возможные последствия. </p> 
<p>Если я нарушаю любое из этих обязательств, или, в случае обмана, я становлюсь нарушителем законов моей страны, и <B>принимаю на себя всю ответственность за мои действия</B>. Я заявляю, что был полностью проинформирован о предлагаемом содержании и отказываюсь от любых процессуальных действий против провайдера доступа и администраторов этого сайта. Я внимательно прочитал все вышеизложенные пункты и электронно подписываю моё согласие с прочтенным, путём выбора и нажатия кнопки, соответствующей моему возрасту.

';
$lang['NEW! Check the Plugin PWG Stuffs to add the disclaimer on the index/album pages'] = 'Новое! Проверка для плагина PWG Stuffs - добавление заявления об отказе от ответственности на страницах альбома и в содержании';
$lang['No options. Just check "Allow unregistered users to select their age?" on the Adult Content administration page'] = 'Без вариантов. Только проверка "Разрешать незарегистрированным пользователям выбирать их возраст?" в плагине Adult Content на странице администратора';
$lang['ad_c_howitworks'] = 'Назначение данного плагина - помочь Вам в управлении "взрослым" контентом(Вы также можете адаптировать его и для контента со сценами насилия). Плагин управляет посетителями и/или пользователями так, как Вы определили, устанавливая соответствующие параметры плагина. <br />
<br />
1 - Как администратор, Вы должны сами разместить контент "для взрослых" в приватную галерею или альбом (плагин самостоятельно не управляет правами просмотра изображений, по крайней мере, пока). Затем присоедините галерею или альбом в группу "18" или "16-17" (группы создаются плагином) следующим образом:<br /><br />

- в группе "18" разрешается просмотр содержимого, предназначенного для пользователей старше 18 лет, а также обычного содержимого (хотя обычное содержимое, как правило, делают сразу публичным)
<br /><br />
- в группе "16-17" разрешается просмотр содержимого, предназначенного для пользователей старше 16 лет, а также обычного содержимого (хотя обычное содержимое, как правило, делают сразу публичным)
<br /><br />
- в группе "ничего такого" разрешается просмотр обычного содержимого (хотя обычное содержимое, как правило, делают сразу публичным)
<br />

<br />
2 - Применение плагина<br />
2.1 - Управление пользователями<br />
<br />
Если пользователь уже зарегистрирован и активирован в галерее, то плагин показывает ему маленькое окно с кнопкой, где он должен выбрать свой возраст. После нажатия появляется сообщение о "Содержимом для взрослых" и возможность выбора возраста (Charte_user.php).

После того, как пользователь выбирает свой возраст, его повторно перенаправляют к странице выбора возраста (Charte_user.php) только непосредственно после регистрации.

В общем, плагин объединяет пользователям по трем группам "18", 16-17" и "ничего такого", основываясь на сообщенных данных о возрасте. Пользователь может в любое время сменить данные о возрасте через блок меню "Содержимое для взрослых". Это блок включается и выключается для доступа пользователей администратором Piwigo (обратите внимание, что наличие прямой ссылки на charte_user.php все равно продолжает действовать). Т.е. если Вы хотите запретить пользователям выбирать свой возраст, то с помощью именно плагина Вам это не удасться - придется ставить другие ограничения на просмотр изображений.<br />
<br />
2.2 - Управление посетителями<br />
<br />
Если функция \'Разрешить незарегистрированным посетителям выбирать свой возраст?\' включена, что модуль работает также, как и с пользователями. * Он отображает в меню, что показано не всё содержимое галереи (часть отфильтрована) и для того, чтобы посетитель мог указать свой возраст, он должен отключить этот фильтр. Для этого он будет перенаправлен на страницу выбора возраста (chartre.php).

В общем, плагин объединяет посетителей в две группы: "18" - тех, кто старше 18 лет, и "16-17" - тех, кто старше 16 лет. Эти два пользовательских аккаунта не могут быть изменены посетителями, а только администратором. Для этого откройте и измените тему, согласно возраста этих двух аккаунтов.<br />
<br />
2.3 - Возможность адаптации<br />
<br />
Вы может адаптировать и применять этот плагин для содержимого со сценами насилия, просто поменяв текст в файле (лучше всего для редактирования текста использовать плагин Local Files Editor). Точно также можно внести изменения и в возрастные ограничения.';
?>