<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2012 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['ac_button_activ_16'] = 'Активізуйте еротичний вміст';
$lang['ac_button_activ_18'] = 'Активізуйте порнографічний вміст';
$lang['ac_fermer'] = 'або закрити';
$lang['ac_identif'] = 'або увійти';
$lang['ac_lien'] = 'видаліть цей захист';
$lang['ac_logout'] = 'або в іншому випадку натисніть тут';
$lang['ac_title_fermer'] = 'вміст фільтрований';
$lang['ac_title_menu_statut'] = 'Інформація';
$lang['ac_title_menu'] = 'Попередження';
$lang['ac_user_no_s'] = 'Вміст фільтрований';
$lang['ac_user_text_16'] = 'Вам 16 або 17 років';
$lang['ac_user_text_18'] = 'Вам більш ніж 18 років';
$lang['ad_c_linktolang'] = 'Перейти до мовного файлу із вмістом для дорослих (необхідно ввімкнути LocalFiles Editor)';
$lang['ad_c_manage_both'] = 'еротичний і порнографічний вміст';
$lang['ad_c_manage_eroticonly'] = 'лише еротичний зміст';
$lang['ad_c_manage_pornonly'] = 'тільки порнографічний зміст';
$lang['ad_c_msg_admin_1'] = 'Конфігурація плаґіна успішно оновлена!';
$lang['ad_c_send'] = 'Зберегти зміни';
$lang['ac_charte_user_def'] = 'або в іншому випадку натисніть тут';
$lang['ac_charte_user_not'] = 'Будь ласка, виберіть ваш вік!';
$lang['ac_def'] = 'Ви хочете змінити свій статус?';
$lang['ac_not_def'] = 'Цей етап є необхідним, але не буде запропонований вам більше';
$lang['ac_retour_b'] = 'Я не хочу бачити вміст такого типу';
$lang['ac_retour_c'] = 'Я повертаюся до попередньої сторінки';
$lang['ac_retour'] = 'Я не бажаю активізувати цей тип вмісту і я повертаюся на попередню сторінцу';
$lang['ac_statut'] = 'Ваш закон:';
$lang['ac_text_activ_16'] = '<u>... і я гарантую, з чистим серцем, що</u>: <br>
- <B>Мені 16 або 17 років.</B> <br> 
- Я попереджений, що цей сайт пропонує зображень еротичного характеру. <br> 
- Закони моєї країни дозволяють мені переглядати цей сайт.';
$lang['ac_text_activ_18'] = '<u>... і я гарантую, з чистим серцем, що</u>: <br> 
- <B>Мені більш ніж 18 років, і я повнолітній </B> відповідно до законодавства в моїй країні . <br> 
- Я попереджений, що цей сайт пропонує зображень порнографічного і еротичного характеру. <br> 
- Закони моєї країни дозволяють мені переглядати цей сайт.';
$lang['ac_text'] = 'Ця галерея містить зображення, для зрілих осіб та\або дорослих.';
$lang['ac_user_no'] = 'ви не бажаєте активувати цей тип вмісту';
$lang['ad_c_manage_what'] = 'Виберіть тип вмісту, яким плаґін повинен керувати:';
$lang['ad_c_menublock_for_guest'] = 'Дозволити незареєстрованим користувачам вибирати свій вік?';
$lang['Disclaimer for the guest, with the ability to choose its age to unlock the adult content'] = 'Оголошення гостьовим користувачам, з можливістю вказати власний вік';
$lang['NEW! Check the Plugin PWG Stuffs to add the disclaimer on the index/album pages'] = 'Новинка! Увімкніть плагін PWG Stuffs для автоматичного додання оголошення на індексних/альбомних сторінках';
$lang['No options. Just check "Allow unregistered users to select their age?" on the Adult Content administration page'] = 'Налаштування відсутні. Просто увімкніть "Дозволяти незареєстрованим користувачам вказувати їх вік?" на сторінці адміністрування вмісту для дорослих';
$lang['ac_text_charte'] = 'Ви входите на сайт візуальний вміст якого носить еротичний, або порнографічний характер призначений виключено для попереджених відвідувачів, яким дозволено переглядати даний вміст. Відвідування даного сайту відбувається з особистого бажання відвідувача. Діючий сайт знімає з себе будь-яку відповідальність за наслідки, які можуть буть бути нанесені вмістом і послугами сайту будь-якій людині, аж до того, що будь-хто може бути шокований. Кожен відвідувач увійшовши на сайт публічно попереджений і приймає на себе всі можливі наслідки. </p>

<p>Якщо я порушую будь-яке з цих зобов’язань або у разі неправдивих відомостей, я можу бути покараний згідно законів своєї країни, і <B>приймаю на себе повну відповідальність за свої вчинки</B>. Я заявляю, що був повністю проінформований про наданий вміст і відмовляюсь від будь-яких процесуальних дій проти хостинг-провайдера і адміністраторів цього сайту. Я уважно прочитав всі вищезазначені пункти і електронно підписую мою згоду з прочитаним, шляхом вибору і натиснення кнопки, відповідно до мого віку.';
$lang['ad_c_howitworks'] = 'Цей плагін допомогає в управлінні контентом для дорослих (він також може бути адаптованим для насильницького контенту). Для цього плагін управляє відвідувачами та/чи користувачами, як ви хочете, згідно з вашими налаштуваннями плагіну.<br />
<br />
1 - Як адміністратор, ви повинні розмістити ваш контент для дорослих у приватну галерею чи альбом (плагін сам не може управляти правами на рівні зображень, принаймні покищо ні). Після цього призначте галерею чи альбом до двох груп \'18\' та \' 16-17\' (які створив плагін)

як це:<br /><br />

-дозвольте групі \'18\' передивлятись дорослий контент, призначений для користувачів віком від 18 та нормальний контент (яле зазвичай нормальний контент часто публічний)
<br /><br />
-дозвольте групі \' 16-17\' передивлятись дорослий контент, призначений для перегляду користувачами віком від 16 років та нормальний контент (яле зазвичай нормальний контент часто публічний)
<br /><br />
- група \'nothing\' має можливість переглядати нормальний контент (яле зазвичай нормальний контент часто публічний)
<br />

<br />
2 - Як плагін працює<br />
2.1 - Управління користувачами<br />
<br />
Якщо користувач був зареєстрований до активації плагіну, плагін покаже йому маленький блок з запрошенням обрати свій вік. Коли він клацне мишкою, з\'явиться сторінка з попередженням \'контент для дорослих\' та запропонує вибрати свій вік (Charte_user.php).

Якщо відвідувач вибирає свій вік, він також направляється на сторінку вибору віку (Charte_user.php), безпосередньо після його запису.

На практиці, плагім приписує користувача до трьох груп \' 18\' \' 16-17\' та \'nothing\', залежно від його вибору віку. Користувач має можливість у будьякий час змінити свій вік у меню контенту для дорослих, якщо ця можливість не відключена через меню адміністрування piwigo (УВАГА пряме посилання до charte_user.php буде діяти все рівно) : якщо ви бажаєте, щоб користувач не міг змінити свій вік, то цей плагін недоцільний і ви маєте використовувати власноруч управління правами на рівні альбомів та зображень.<br />
<br />
2.2 - Управління відвідувачами<br />
<br />
Якщо включена опція \'Дозволяти не зареєстрованим відвідувачам обирати свій вік?\', то плагін буде керувати відвідувачами. * Плагін покаже пункт меню, що галерея \'фільтрована\' та якщо він бажає вимкнути фільтр, він повинен обрати свій вік. Цей пункт меню перенаправлятиме на сторінку вибору віку (chartre.php).

На практиці, відвідувач буде приписан до одного з двох користувачів, що створив плагін: \'18\' що належить до групи \' 18 \', та \' 16\' що належить до групи \' 16-17 \'.  Ці два акаунта користувачів не можуть бути змінені користувачами, а лише адміністратором.
Ви можете обрати різьні теми в залежності від віку відвідувача через ці дві реєстраційні записи.<br />
<br />
2.3 - Можлива адаптація<br />
<br />
Ви можете адаптувати цей плагін до насильницького контенту, змінивши файли мови плагіну (використовуйте плагін Local Files Editor для полегшення редагування).  Ліміт віку також може бути змінено таким самим чином.';